SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Include/gd32e23x_hal_rtc.h
/*!
    \file    gd32e23x_hal_rtc.h
    \brief   definitions for the RTC
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32E23X_HAL_RTC_H
#define GD32E23X_HAL_RTC_H

#include "gd32e23x_hal.h"

/* constants definitions */
typedef enum {
    HAL_RTC_INIT_STRUCT,                                                    /*!< structure <hal_rtc_init_struct> */
    HAL_RTC_ALARM_STRUCT,                                                   /*!< structure <hal_rtc_alarm_struct> */
    HAL_RTC_TIMESTAMP_STRUCT,                                               /*!< structure <hal_rtc_timestamp_struct> */
    HAL_RTC_TAMPER_STRUCT,                                                  /*!< structure <hal_rtc_tamper_struct> */
    HAL_RTC_IRQ_STRUCT,                                                     /*!< structure <hal_rtc_irq_struct> */
} hal_rtc_struct_type_enum;

/* RTC month definitions */
typedef enum{
    HAL_RTC_JAN = RTC_JAN,                                                  /*!< Janurary */
    HAL_RTC_FEB = RTC_FEB,                                                  /*!< February */
    HAL_RTC_MAR = RTC_MAR,                                                  /*!< March */
    HAL_RTC_APR = RTC_APR,                                                  /*!< April */
    HAL_RTC_MAY = RTC_MAY,                                                  /*!< May */
    HAL_RTC_JUN = RTC_JUN,                                                  /*!< June */
    HAL_RTC_JUL = RTC_JUL,                                                  /*!< July */
    HAL_RTC_AUG = RTC_AUG,                                                  /*!< August */
    HAL_RTC_SEP = RTC_SEP,                                                  /*!< September */
    HAL_RTC_OCT = RTC_OCT,                                                  /*!< October */
    HAL_RTC_NOV = RTC_NOV,                                                  /*!< November */
    HAL_RTC_DEC = RTC_DEC,                                                  /*!< December */    
} hal_rtc_month_enum;

/* day of a week definitions */
typedef enum{
    HAL_RTC_MONDAY = RTC_MONDAY,                                            /*!< Monday */
    HAL_RTC_TUESDAY = RTC_TUESDAY,                                          /*!< Tuesday */
    HAL_RTC_WEDSDAY = RTC_WEDSDAY,                                          /*!< Wednesday */
    HAL_RTC_THURSDAY = RTC_THURSDAY,                                        /*!< Thursday */
    HAL_RTC_FRIDAY = RTC_FRIDAY,                                            /*!< Friday */
    HAL_RTC_SATURDAY = RTC_SATURDAY,                                        /*!< Saturday */
    HAL_RTC_SUNDAY = RTC_SUNDAY,                                            /*!< Sunday */
} hal_rtc_day_of_week_enum;

/* RTC tamper event sampling frequency definitions */
typedef enum{
    HAL_RTC_FREQ_DIV32768 = RTC_FREQ_DIV32768,                              /*!< sample once every 32768 RTCCLK(1Hz if RTCCLK=32.768KHz) */
    HAL_RTC_FREQ_DIV16384 = RTC_FREQ_DIV16384,                              /*!< sample once every 16384 RTCCLK(2Hz if RTCCLK=32.768KHz) */
    HAL_RTC_FREQ_DIV8192 = RTC_FREQ_DIV8192,                                /*!< sample once every 8192 RTCCLK(4Hz if RTCCLK=32.768KHz) */
    HAL_RTC_FREQ_DIV4096 = RTC_FREQ_DIV4096,                                /*!< sample once every 4096 RTCCLK(8Hz if RTCCLK=32.768KHz) */
    HAL_RTC_FREQ_DIV2048 = RTC_FREQ_DIV2048,                                /*!< sample once every 2048 RTCCLK(16Hz if RTCCLK=32.768KHz) */
    HAL_RTC_FREQ_DIV1024 = RTC_FREQ_DIV1024,                                /*!< sample once every 1024 RTCCLK(32Hz if RTCCLK=32.768KHz) */
    HAL_RTC_FREQ_DIV512 = RTC_FREQ_DIV512,                                  /*!< sample once every 512 RTCCLK(64Hz if RTCCLK=32.768KHz) */
    HAL_RTC_FREQ_DIV256 = RTC_FREQ_DIV256,                                  /*!< sample once every 256 RTCCLK(128Hz if RTCCLK=32.768KHz) */
} hal_rtc_tamper_freq_enum;

typedef void (*hal_rtc_irq_handle_cb)(void);

/* structure for initialization of the RTC */
typedef struct
{
    uint8_t rtc_year;                                                       /*!< RTC year value: 0x0 - 0x99(BCD format) */
    hal_rtc_month_enum rtc_month;                                           /*!< RTC month value */
    uint8_t rtc_date;                                                       /*!< RTC date value: 0x1 - 0x31(BCD format) */
    hal_rtc_day_of_week_enum rtc_day_of_week;                               /*!< RTC weekday value */
    uint8_t rtc_hour;                                                       /*!< RTC hour value */
    uint8_t rtc_minute;                                                     /*!< RTC minute value: 0x0 - 0x59(BCD format) */
    uint8_t rtc_second;                                                     /*!< RTC second value: 0x0 - 0x59(BCD format) */
    uint16_t rtc_subsecond;                                                 /*!< RTC subsecond value: 0x0 - 0xFFFF */    
    uint16_t rtc_factor_asyn;                                               /*!< RTC asynchronous prescaler value: 0x0 - 0x7F */
    uint16_t rtc_factor_syn;                                                /*!< RTC synchronous prescaler value: 0x0 - 0x7FFF */
    uint32_t rtc_am_pm;                                                     /*!< RTC AM/PM value */
    uint32_t rtc_display_format;                                            /*!< RTC time notation */
}hal_rtc_init_struct;

/* structure for RTC alarm configuration */
typedef struct
{
    uint32_t rtc_alarm_mask;                                                /*!< RTC alarm mask */   
    uint32_t rtc_weekday_or_date;                                           /*!< specify RTC alarm is on date or weekday */
    uint8_t rtc_alarm_day;                                                  /*!< RTC alarm date or weekday value*/
    uint8_t rtc_alarm_hour;                                                 /*!< RTC alarm hour value */
    uint8_t rtc_alarm_minute;                                               /*!< RTC alarm minute value: 0x0 - 0x59(BCD format) */
    uint8_t rtc_alarm_second;                                               /*!< RTC alarm second value: 0x0 - 0x59(BCD format) */
    uint32_t rtc_alarm_subsecond;                                           /*!< RTC alarm subsecond value: (0x000 - 0x7FFF) */    
    uint32_t rtc_alarm_subsecond_mask;                                      /*!< RTC alarm subsecond mask */ 
    uint32_t rtc_am_pm;                                                     /*!< RTC alarm AM/PM value */
}hal_rtc_alarm_struct;

/* structure for RTC time-stamp configuration */
typedef struct
{
    uint8_t rtc_timestamp_month;                                            /*!< RTC time-stamp month value */
    uint8_t rtc_timestamp_date;                                             /*!< RTC time-stamp date value: 0x1 - 0x31(BCD format) */
    uint8_t rtc_timestamp_day;                                              /*!< RTC time-stamp weekday value */
    uint8_t rtc_timestamp_hour;                                             /*!< RTC time-stamp hour value */
    uint8_t rtc_timestamp_minute;                                           /*!< RTC time-stamp minute value: 0x0 - 0x59(BCD format) */
    uint8_t rtc_timestamp_second;                                           /*!< RTC time-stamp second value: 0x0 - 0x59(BCD format) */
    uint32_t rtc_timestamp_subsecond;                                       /*!< RTC time-stamp subsecond value: 0x0 - 0xFFFF */    
    uint32_t rtc_am_pm;                                                     /*!< RTC time-stamp AM/PM value */
}hal_rtc_timestamp_struct;

