SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Include/gd32e23x_hal_rtc.h
/* structure for RTC tamper configuration */
typedef struct
{
    uint32_t rtc_tamper_source;                                             /*!< RTC tamper source */
    uint32_t rtc_tamper_trigger;                                            /*!< RTC tamper trigger */
    uint32_t rtc_tamper_filter;                                             /*!< RTC tamper consecutive samples needed during a voltage level detection */
    hal_rtc_tamper_freq_enum rtc_tamper_sample_frequency;                   /*!< RTC tamper sampling frequency during a voltage level detection */
    ControlStatus rtc_tamper_precharge_enable;                              /*!< RTC tamper precharge feature during a voltage level detection */
    uint32_t rtc_tamper_precharge_time;                                     /*!< RTC tamper precharge duration if precharge feature is enabled */
    ControlStatus rtc_tamper_with_timestamp;                                /*!< RTC tamper time-stamp feature */
}hal_rtc_tamper_struct; 

/* RTC IRQ structure */
typedef struct {
    hal_rtc_irq_handle_cb alarm_handle;                                     /*!< RTC alarm handler */
    hal_rtc_irq_handle_cb timestamp_handle;                                 /*!< RTC timestamp handler */
    hal_rtc_irq_handle_cb tamper0_handle;                                   /*!< RTC tamper handler */
    hal_rtc_irq_handle_cb tamper1_handle;                                   /*!< RTC tamper handler */
} hal_rtc_irq_struct;

/* hour format */
#define HAL_RTC_24HOUR                           RTC_24HOUR                 /*!< 24-hour format */
#define HAL_RTC_12HOUR                           RTC_12HOUR                 /*!< 12-hour format */

/* AM/PM mark */
#define HAL_RTC_AM                               RTC_AM                     /*!< AM format */
#define HAL_RTC_PM                               RTC_PM                     /*!< PM format */

/* winter/summer time change */
#define HAL_RTC_DAYLIGHTSAVING_1HOUR_ADD         RTC_CTL_A1H                /*!< add 1 hour(summer time change) */
#define HAL_RTC_DAYLIGHTSAVING_1HOUR_SUBTRACT    RTC_CTL_S1H                /*!< subtract 1 hour(winter time change) */
#define HAL_RTC_DAYLIGHTSAVING_NONE              ((uint32_t)0x00000000U)    /*!< no add or subtract 1 hour */

/* daylight saving mark */
#define HAL_RTC_RECORD_DAYLIGHTSAVING_SET        RTC_CTL_DSM                /*!< set daylight saving mark */
#define HAL_RTC_RECORD_DAYLIGHTSAVING_RESET      ((uint32_t)0x00000000U)    /*!< reset daylight saving mark */

/* alarm mark */
#define HAL_RTC_ALARM_NONE_MASK                  RTC_ALARM_NONE_MASK        /*!< alarm none mask */
#define HAL_RTC_ALARM_DATE_MASK                  RTC_ALARM_DATE_MASK        /*!< alarm date mask */
#define HAL_RTC_ALARM_HOUR_MASK                  RTC_ALARM_HOUR_MASK        /*!< alarm hour mask */
#define HAL_RTC_ALARM_MINUTE_MASK                RTC_ALARM_MINUTE_MASK      /*!< alarm minute mask */
#define HAL_RTC_ALARM_SECOND_MASK                RTC_ALARM_SECOND_MASK      /*!< alarm second mask */
#define HAL_RTC_ALARM_ALL_MASK                   RTC_ALARM_ALL_MASK         /*!< alarm all mask */

/* day of the week selected */
#define HAL_RTC_ALARM_DATE_SELECTED              RTC_ALARM_DATE_SELECTED    /*!< alarm date format selected */
#define HAL_RTC_ALARM_WEEKDAY_SELECTED           RTC_ALARM_WEEKDAY_SELECTED /*!< alarm weekday format selected */

/* alarm subsecond mark */
#define HAL_RTC_MASK_SUBSECOND                   RTC_MASKSSC_0_14           /*!< mask alarm subsecond configuration */
#define HAL_RTC_MASK_SUBSECOND_1_14              RTC_MASKSSC_1_14           /*!< mask RTC_ALRM0SS_SSC[14:1], and RTC_ALRM0SS_SSC[0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_2_14              RTC_MASKSSC_2_14           /*!< mask RTC_ALRM0SS_SSC[14:2], and RTC_ALRM0SS_SSC[1:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_3_14              RTC_MASKSSC_3_14           /*!< mask RTC_ALRM0SS_SSC[14:3], and RTC_ALRM0SS_SSC[2:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_4_14              RTC_MASKSSC_4_14           /*!< mask RTC_ALRM0SS_SSC[14:4], and RTC_ALRM0SS_SSC[3:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_5_14              RTC_MASKSSC_5_14           /*!< mask RTC_ALRM0SS_SSC[14:5], and RTC_ALRM0SS_SSC[4:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_6_14              RTC_MASKSSC_6_14           /*!< mask RTC_ALRM0SS_SSC[14:6], and RTC_ALRM0SS_SSC[5:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_7_14              RTC_MASKSSC_7_14           /*!< mask RTC_ALRM0SS_SSC[14:7], and RTC_ALRM0SS_SSC[6:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_8_14              RTC_MASKSSC_8_14           /*!< mask RTC_ALRM0SS_SSC[14:8], and RTC_ALRM0SS_SSC[7:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_9_14              RTC_MASKSSC_9_14           /*!< mask RTC_ALRM0SS_SSC[14:9], and RTC_ALRM0SS_SSC[8:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_10_14             RTC_MASKSSC_10_14          /*!< mask RTC_ALRM0SS_SSC[14:10], and RTC_ALRM0SS_SSC[9:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_11_14             RTC_MASKSSC_11_14          /*!< mask RTC_ALRM0SS_SSC[14:11], and RTC_ALRM0SS_SSC[10:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_12_14             RTC_MASKSSC_12_14          /*!< mask RTC_ALRM0SS_SSC[14:12], and RTC_ALRM0SS_SSC[11:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_13_14             RTC_MASKSSC_13_14          /*!< mask RTC_ALRM0SS_SSC[14:13], and RTC_ALRM0SS_SSC[12:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_14                RTC_MASKSSC_14             /*!< mask RTC_ALRM0SS_SSC[14], and RTC_ALRM0SS_SSC[13:0] is to be compared */
#define HAL_RTC_MASK_SUBSECOND_NONE              RTC_MASKSSC_NONE           /*!< mask none, and RTC_ALRM0SS_SSC[14:0] is to be compared */

/* timeout */
#define RTC_ALRM0F_TIMEOUT                       ((uint32_t)0xFFFFFFFFU)    /*!< alarm occur flag timeout */
#define RTC_TIMESTAMP_TIMEOUT                    ((uint32_t)0xFFFFFFFFU)    /*!< timestamp occur flag timeout */
#define RTC_TAMPER0_TIMEOUT                      ((uint32_t)0xFFFFFFFFU)    /*!< tamper 0 occur flag timeout */
#define RTC_TAMPER1_TIMEOUT                      ((uint32_t)0xFFFFFFFFU)    /*!< tamper 1 occur flag timeout */

/* rising/falling edge is valid event edge for time-stamp event */
#define HAL_RTC_TIMESTAMP_RISING_EDGE            RTC_TIMESTAMP_RISING_EDGE  /*!< rising edge is valid event edge for time-stamp event */
#define HAL_RTC_TIMESTAMP_FALLING_EDGE           RTC_TIMESTAMP_FALLING_EDGE /*!< falling edge is valid event edge for time-stamp event */

/* tamper source */
#if defined(GD32E230)
#define HAL_RTC_TAMPER0                          RTC_TAMPER0                /*!< tamper 0 detection enable */
#endif /* GD32E230 */
#define HAL_RTC_TAMPER1                          RTC_TAMPER1                /*!< tamper 1 detection enable */

/* tamper detection mode */
#define HAL_RTC_TAMPER_EDGE_RISING               RTC_TAMPER_TRIGGER_EDGE_RISING  /*!< tamper detection is in rising edge mode */
#define HAL_RTC_TAMPER_EDGE_FALLING              RTC_TAMPER_TRIGGER_EDGE_FALLING /*!< tamper detection is in falling edge mode */
#define HAL_RTC_TAMPER_LEVEL_LOW                 RTC_TAMPER_TRIGGER_LEVEL_LOW    /*!< tamper detection is in low level mode */
#define HAL_RTC_TAMPER_LEVEL_HIGH                RTC_TAMPER_TRIGGER_LEVEL_HIGH   /*!< tamper detection is in high level mode */

/* tamper sampling type and the number of consecutive sample */
#define HAL_RTC_FILTER_EDGE                      RTC_FLT_EDGE               /*!< detecting tamper event using edge mode. precharge duration is disabled automatically */
#define HAL_RTC_FILTER_2_SAMPLE                  RTC_FLT_2S                 /*!< detecting tamper event using level mode.2 consecutive valid level samples will make a effective tamper event  */
#define HAL_RTC_FILTER_4_SAMPLE                  RTC_FLT_4S                 /*!< detecting tamper event using level mode.4 consecutive valid level samples will make an effective tamper event */
#define HAL_RTC_FILTER_8_SAMPLE                  RTC_FLT_8S                 /*!< detecting tamper event using level mode.8 consecutive valid level samples will make a effective tamper event  */

