SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Include/gd32e23x_hal_rtc.h
/* the precharge time before each sampling */
#define HAL_RTC_1_CLK_PRECHARGE                  RTC_PRCH_1C                /*!< 1 RTC clock prechagre time before each sampling */
#define HAL_RTC_2_CLK_PRECHARGE                  RTC_PRCH_2C                /*!< 2 RTC clock prechagre time before each sampling  */
#define HAL_RTC_4_CLK_PRECHARGE                  RTC_PRCH_4C                /*!< 4 RTC clock prechagre time before each sampling */
#define HAL_RTC_8_CLK_PRECHARGE                  RTC_PRCH_8C                /*!< 8 RTC clock prechagre time before each sampling */

/* frequency compensation window */
#define HAL_RTC_CALIBRATION_32S                  RTC_CALIBRATION_WINDOW_32S /*!< 2exp20 RTCCLK cycles, 32s if RTCCLK = 32768 Hz */
#define HAL_RTC_CALIBRATION_16S                  RTC_CALIBRATION_WINDOW_16S /*!< 2exp19 RTCCLK cycles, 16s if RTCCLK = 32768 Hz */
#define HAL_RTC_CALIBRATION_8S                   RTC_CALIBRATION_WINDOW_8S  /*!< 2exp18 RTCCLK cycles, 8s if RTCCLK = 32768 Hz */

/* increase RTC frequency by 488.5PPM */
#define HAL_RTC_CALIBRATION_PLUS_SET             RTC_CALIBRATION_PLUS_SET   /*!< increase RTC frequency by 488.5ppm */
#define HAL_RTC_CALIBRATION_PLUS_RESET           RTC_CALIBRATION_PLUS_RESET /*!< no effect */

/* add 1 second to the clock */
#define HAL_RTC_ADD1S_RESET                      RTC_SHIFT_ADD1S_RESET      /*!< not add 1 second */
#define HAL_RTC_ADD1S_SET                        RTC_SHIFT_ADD1S_SET        /*!< add one second to the clock */

/* calibration/alarm output */
#define HAL_RTC_CALIBRATION_OUT_512HZ            RTC_CALIBRATION_512HZ      /*!< calibration output of 512Hz is enable */
#define HAL_RTC_CALIBRATION_OUT_1HZ              RTC_CALIBRATION_1HZ        /*!< calibration output of 1Hz is enable */
#define HAL_RTC_CALIBRATION_OUT_DISABLE          0U                         /*!< calibration output is disable */
#define HAL_RTC_ALARM_OUT_HIGH                   RTC_ALARM_HIGH             /*!< enable alarm flag output with high level */
#define HAL_RTC_ALARM_OUT_LOW                    RTC_ALARM_LOW              /*!< enable alarm flag output with low level*/
#define HAL_RTC_ALARM_OUT_DISABLE                1U                         /*!< disable alarm flag output*/

/* alarm output mode */
#define HAL_RTC_ALARM_OUTPUT_OD                  RTC_ALARM_OUTPUT_OD        /*!< RTC alarm output open-drain mode */
#define HAL_RTC_ALARM_OUTPUT_PP                  RTC_ALARM_OUTPUT_PP        /*!< RTC alarm output push-pull mode */

/* function declarations */
/* initialize the specified structure */
void hal_rtc_struct_init(hal_rtc_struct_type_enum hal_struct_type, void *p_struct);
/* deinitialize RTC */
int32_t hal_rtc_deinit(void);
/* initialize RTC */
int32_t hal_rtc_init(hal_rtc_init_struct* rtc_initpara_struct);
/* wait until RTC_TIME and RTC_DATE registers are synchronized with APB clock, and the shadow registers are updated */
int32_t hal_rtc_register_sync_wait(void);

/* get current time and date */
void hal_rtc_current_time_get(hal_rtc_init_struct* rtc_initpara_struct);

/* configure RTC alarm */
int32_t hal_rtc_alarm_config(hal_rtc_alarm_struct* rtc_alarm_time);
/* enable RTC alarm */
void hal_rtc_alarm_enable(void);
/* enable RTC alarm by interrupt method */
/* the function is non-blocking */
int32_t hal_rtc_alarm_enable_interrupt(hal_rtc_irq_handle_cb irq_handle);
/* disable RTC alarm */
int32_t hal_rtc_alarm_disable(void);
/* get RTC alarm */
void hal_rtc_alarm_get(hal_rtc_alarm_struct* rtc_alarm_time);
/* poll for RTC alarm event */
/* the function is blocking */
int32_t hal_rtc_alarm_event_poll(uint32_t timeout_ms);

/* configure RTC time-stamp */
int32_t hal_rtc_timestamp_config(uint32_t edge);
/* enable RTC time-stamp */
void hal_rtc_timestamp_enable(void);
/* enable RTC time-stamp by interrupt method */
/* the function is non-blocking */
int32_t hal_rtc_timestamp_enable_interrupt(hal_rtc_irq_handle_cb irq_handle);
/* disable RTC time-stamp */
void hal_rtc_timestamp_disable(void);
/* get RTC timestamp time and date */
void hal_rtc_timestamp_get(hal_rtc_timestamp_struct* rtc_timestamp);
/* configure RTC tamper */
int32_t hal_rtc_tamper_config(hal_rtc_tamper_struct* rtc_tamper);
/* enable RTC tamper */
int32_t hal_rtc_tamper_enable(uint32_t source);
/* enable RTC tamper by interrupt method */
/* the function is non-blocking */
int32_t hal_rtc_tamper_enable_interrupt(uint32_t source, hal_rtc_irq_handle_cb irq_handle);
/* disable RTC tamper */
int32_t hal_rtc_tamper_disable(uint32_t source);
/* poll for RTC timestamp event */
/* the function is blocking */
int32_t hal_rtc_timestamp_event_poll(uint32_t timeout_ms);
/* poll for RTC tamper0 event */
/* the function is blocking */
int32_t hal_rtc_tamper0_event_poll(uint32_t timeout_ms);
/* poll for RTC tamper1 event */
/* the function is blocking */
int32_t hal_rtc_tamper1_event_poll(uint32_t timeout_ms);

/* RTC interrupt handler content function */
void hal_rtc_irq(void);
/* set user-defined interrupt callback function, 
which will be registered and called when corresponding interrupt be triggered */
void hal_rtc_irq_handle_set(hal_rtc_irq_struct *p_irq);
/* reset all user-defined interrupt callback function, 
which will be registered and called when corresponding interrupt be triggered */
void hal_rtc_irq_handle_all_reset(void);

/* write data to backup register */
int32_t hal_rtc_backup_data_write(uint32_t backup_index, uint32_t data);
/* read data from backup register */
int32_t hal_rtc_backup_data_read(uint32_t backup_index, uint32_t *data);
/* enable RTC bypass shadow registers function */
void hal_rtc_bypass_shadow_enable(void);
/* disable RTC bypass shadow registers function */
void hal_rtc_bypass_shadow_disable(void);
/* enable RTC reference clock detection function */
int32_t hal_rtc_refclock_detection_enable(void);
/* disable RTC reference clock detection function */
int32_t hal_rtc_refclock_detection_disable(void);

/* configure RTC alternate output source */
int32_t hal_rtc_output_config(uint32_t source, uint32_t mode);
/* configure RTC calibration register */
int32_t hal_rtc_calibration_config(uint32_t window, uint32_t plus, uint32_t minus);
/* ajust the daylight saving time by adding or substracting one hour from the current time */
void hal_rtc_daylight_saving_time_adjust(uint32_t operation, uint32_t record);
/* ajust RTC second or subsecond value of current time */
int32_t hal_rtc_sync_with_remote_clock_adjust(uint32_t add, uint32_t minus);

/* convert from  BCD format to binary format */
uint8_t rtc_bcd_2_normal(uint8_t data);
/* convert from  BCD format to binary format */
uint8_t rtc_normal_2_bcd(uint8_t data);

#endif /* GD32E23X_HAL_RTC_H */
